Table of Contents
 Class BimLink
Namespace
IdeaStatiCa.BimApiLink
Assembly
IdeaStatiCa.BimApiLink.dll
public abstract class BimLink
Inheritance
object
BimLink
Derived
CadBimLink
FeaBimLink
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 BimLink(string, string)
protected BimLink(string applicationName, string projectPath)
Parameters
applicationName string
projectPath string
Properties
 ApplicationName
protected string ApplicationName { get; }
Property Value
string
Methods
 Create(IPluginLogger, IBimApiImporter, string, BimImporterConfiguration, IProgressMessaging, IBimResultsProvider, IPluginHook, IScopeHook, IModel, IBimUserDataSource, TaskScheduler)
protected abstract IApplicationBIM Create(IPluginLogger logger, IBimApiImporter bimApiImporter, string projectPath, BimImporterConfiguration bimImporterConfiguration, IProgressMessaging remoteApp, IBimResultsProvider resultsProvider, IPluginHook pluginHook, IScopeHook scopeHook, IModel model, IBimUserDataSource userDataSource, TaskScheduler taskScheduler)
Parameters
logger IPluginLogger
bimApiImporter IBimApiImporter
projectPath string
bimImporterConfiguration BimImporterConfiguration
remoteApp IProgressMessaging
resultsProvider IBimResultsProvider
pluginHook IPluginHook
scopeHook IScopeHook
model IModel
userDataSource IBimUserDataSource
taskScheduler TaskScheduler
Returns
IApplicationBIM
 CreateApplicationBIM(IModel, IPluginLogger, IProgressMessaging)
public IApplicationBIM CreateApplicationBIM(IModel model, IPluginLogger pluginLogger, IProgressMessaging remoteApp = null)
Parameters
model IModel
pluginLogger IPluginLogger
remoteApp IProgressMessaging
Returns
IApplicationBIM
 InitHostingClient(IPluginLogger)
public IProgressMessaging InitHostingClient(IPluginLogger pluginLogger)
Parameters
pluginLogger IPluginLogger
Returns
IProgressMessaging
 Run(IModel)
public virtual Task Run(IModel model)
Parameters
model IModel
Returns
Task
 WithBimImporterConfiguration(BimImporterConfiguration)
public BimLink WithBimImporterConfiguration(BimImporterConfiguration configuration)
Parameters
configuration BimImporterConfiguration
Returns
BimLink
 WithIdeaStatiCa(string)
public BimLink WithIdeaStatiCa(string path)
Parameters
path string
Returns
BimLink
 WithImporterHook(IImporterHook)
public BimLink WithImporterHook(IImporterHook hook)
Parameters
hook IImporterHook
Returns
BimLink
 WithImporters(Action<ImportersConfiguration>)
public BimLink WithImporters(Action<ImportersConfiguration> func)
Parameters
func Action<ImportersConfiguration>
Returns
BimLink
 WithLogger(IPluginLogger)
public BimLink WithLogger(IPluginLogger pluginLogger)
Parameters
pluginLogger IPluginLogger
Returns
BimLink
 WithPluginHook(IPluginHook)
public BimLink WithPluginHook(IPluginHook hook)
Parameters
hook IPluginHook
Returns
BimLink
 WithResultsImporters(Action<ResultsImportersConfiguration>)
public BimLink WithResultsImporters(Action<ResultsImportersConfiguration> func)
Parameters
func Action<ResultsImportersConfiguration>
Returns
BimLink
 WithScopeHook(IScopeHook)
public BimLink WithScopeHook(IScopeHook hook)
Parameters
hook IScopeHook
Returns
BimLink
 WithTaskScheduler(TaskScheduler)
public BimLink WithTaskScheduler(TaskScheduler taskScheduler)
Parameters
taskScheduler TaskScheduler
Returns
BimLink
 WithUserDataSource(IBimUserDataSource)
public BimLink WithUserDataSource(IBimUserDataSource userDataSource)
Parameters
userDataSource IBimUserDataSource
Returns
BimLink
 Edit this page